CokeAddictive/Nuclear-Project/Smart_Garbage/Lib/Drivers/stc8h_oled.c
#include "hal_oled.h"
#include "stc8h_oledfont.h"
// OLED的显存
// 存放格式如下.
//[0]0 1 2 3 ... 127
//[1]0 1 2 3 ... 127
//[2]0 1 2 3 ... 127
//[3]0 1 2 3 ... 127
//[4]0 1 2 3 ... 127
//[5]0 1 2 3 ... 127
//[6]0 1 2 3 ... 127
//[7]0 1 2 3 ... 127
static void delay_ms(unsigned int ms) {
    unsigned int a;
    while (ms) {
        a = 1800;
        while (a--)
            ;
        ms--;
    }
    return;
}
// 发送一个字节
// 向SSD1306写入一个字节。
// mode:数据/命令标志 0,表示命令;1,表示数据;
void OLED_WR_Byte(u8 dat, u8 mode) {
    // 	I2C_Start();
    // 	Send_Byte(0x78);
    // 	I2C_WaitAck();
    // 	if(mode){Send_Byte(0x40);}
    //   else{Send_Byte(0x00);}
    // 	I2C_WaitAck();
    // 	Send_Byte(dat);
    // 	I2C_WaitAck();
    // 	I2C_Stop();
    //=========================================
    if (mode) { // 0x78   0x40
        I2C_WriteNbyte(0x78, 0x40, &dat, 1);
    } else { // 0x78   0x00
        I2C_WriteNbyte(0x78, 0x00, &dat, 1);
    }
}


// 反显函数
void OLED_ColorTurn(u8 i) {
    if (i == 0) {
        OLED_WR_Byte(0xA6, OLED_CMD); // 正常显示
    }
    if (i == 1) {
        OLED_WR_Byte(0xA7, OLED_CMD); // 反色显示
    }
}

// 屏幕旋转180度
void OLED_DisplayTurn(u8 i) {
    if (i == 0) {
        OLED_WR_Byte(0xC8, OLED_CMD); // 正常显示
        OLED_WR_Byte(0xA1, OLED_CMD);
    }
    if (i == 1) {
        OLED_WR_Byte(0xC0, OLED_CMD); // 反转显示
        OLED_WR_Byte(0xA0, OLED_CMD);
    }
}

// 延时
void IIC_delay(void) {
    u8 t = 1;
    while (t--)
        ;
}

// 起始信号
void I2C_Start(void) {
    OLED_SDA_Set();
    OLED_SCL_Set();
    IIC_delay();
    OLED_SDA_Clr();
    IIC_delay();
    OLED_SCL_Clr();
}

// 结束信号
void I2C_Stop(void) {
    OLED_SDA_Clr();
    OLED_SCL_Set();
    IIC_delay();
    OLED_SDA_Set();
}

// 等待信号响应
void I2C_WaitAck(void) // 测数据信号的电平
{
    OLED_SDA_Set();
    IIC_delay();
    OLED_SCL_Set();
    IIC_delay();
    OLED_SCL_Clr();
    IIC_delay();
}

// 写入一个字节
void Send_Byte(u8 dat) {
    u8 i;
    for (i = 0; i < 8; i++) {
        OLED_SCL_Clr(); // 将时钟信号设置为低电平
        if (dat & 0x80) // 将dat的8位从最高位依次写入
        {
            OLED_SDA_Set();
        } else {
            OLED_SDA_Clr();
        }
        IIC_delay();
        OLED_SCL_Set();
        IIC_delay();
        OLED_SCL_Clr();
        dat <<= 1;
    }
}


// 坐标设置

void OLED_Set_Pos(u8 x, u8 y) {
    OLED_WR_Byte(0xb0 + y, OLED_CMD);
    OLED_WR_Byte(((x & 0xf0) >> 4) | 0x10, OLED_CMD);
    OLED_WR_Byte((x & 0x0f), OLED_CMD);
}
// 开启OLED显示
void OLED_Display_On(void) {
    OLED_WR_Byte(0X8D, OLED_CMD); // SET DCDC命令
    OLED_WR_Byte(0X14, OLED_CMD); // DCDC ON
    OLED_WR_Byte(0XAF, OLED_CMD); // DISPLAY ON
}
// 关闭OLED显示
void OLED_Display_Off(void) {
    OLED_WR_Byte(0X8D, OLED_CMD); // SET DCDC命令
    OLED_WR_Byte(0X10, OLED_CMD); // DCDC OFF
    OLED_WR_Byte(0XAE, OLED_CMD); // DISPLAY OFF
}
// 清屏函数,清完屏,整个屏幕是黑色的!和没点亮一样!!!
void OLED_Clear(void) {
    u8 i, n;
    for (i = 0; i < 8; i++) {
        OLED_WR_Byte(0xb0 + i, OLED_CMD); // 设置页地址（0~7）
        OLED_WR_Byte(0x00, OLED_CMD);     // 设置显示位置—列低地址
        OLED_WR_Byte(0x10, OLED_CMD);     // 设置显示位置—列高地址
        for (n = 0; n < 128; n++)
            OLED_WR_Byte(0, OLED_DATA);
    } // 更新显示
}

// 在指定位置显示一个字符,包括部分字符
// x:0~127
// y:0~63
// sizey:选择字体 6x8  8x16
void OLED_ShowChar(u8 x, u8 y, u8 chr, u8 sizey) {
    u8 c = 0, sizex = sizey / 2;
    u16 i = 0, size1;
    if (sizey == 8)
        size1 = 6;
    else
        size1 = (sizey / 8 + ((sizey % 8) ? 1 : 0)) * (sizey / 2);
    c = chr - ' '; // 得到偏移后的值
    OLED_Set_Pos(x, y);
    for (i = 0; i < size1; i++) {
        if (i % sizex == 0 && sizey != 8)
            OLED_Set_Pos(x, y++);
        if (sizey == 8)
            OLED_WR_Byte(asc2_0806[c][i], OLED_DATA); // 6X8字号
        else if (sizey == 16)
            OLED_WR_Byte(asc2_1608[c][i], OLED_DATA); // 8x16字号
        //		else if(sizey==xx) OLED_WR_Byte(asc2_xxxx[c][i],OLED_DATA);//用户添加字号
        else
            return;
    }
}
// m^n函数
u32 oled_pow(u8 m, u8 n) {
    u32 result = 1;
    while (n--)
        result *= m;
    return result;
}
// 显示数字
// x,y :起点坐标
// num:要显示的数字
// len :数字的位数
// sizey:字体大小
void OLED_ShowNum(u8 x, u8 y, u32 num, u8 len, u8 sizey) {
    u8 t, temp, m = 0;
    u8 enshow = 0;
    if (sizey == 8)
        m = 2;
    for (t = 0; t < len; t++) {
        temp = (num / oled_pow(10, len - t - 1)) % 10;
        if (enshow == 0 && t < (len - 1)) {
            if (temp == 0) {
                OLED_ShowChar(x + (sizey / 2 + m) * t, y, ' ', sizey);
                continue;
            } else
                enshow = 1;
        }
        OLED_ShowChar(x + (sizey / 2 + m) * t, y, temp + '0', sizey);
    }
}
// 显示一个字符号串
void OLED_ShowString(u8 x, u8 y, u8 *chr, u8 sizey) {
    u8 j = 0;
    while (chr[j] != '\0') {
        OLED_ShowChar(x, y, chr[j++], sizey);
        if (sizey == 8)
            x += 6;
        else
            x += sizey / 2;
    }
}
// 显示汉字
void OLED_ShowChinese(u8 x, u8 y, u8 no, u8 sizey) {
    u16 i, size1 = (sizey / 8 + ((sizey % 8) ? 1 : 0)) * sizey;
    for (i = 0; i < size1; i++) {
        if (i % sizey == 0)
            OLED_Set_Pos(x, y++);
        if (sizey == 16)
            OLED_WR_Byte(Hzk[no][i], OLED_DATA); // 16x16字号
        //		else if(sizey==xx) OLED_WR_Byte(xxx[c][i],OLED_DATA);//用户添加字号
        else
            return;
    }
}

// 显示图片
// x,y显示坐标
// sizex,sizey,图片长宽
// BMP：要显示的图片
void OLED_DrawBMP(u8 x, u8 y, u8 sizex, u8 sizey, u8 BMP[]) {
    u16 j = 0;
    u8 i, m;
    sizey = sizey / 8 + ((sizey % 8) ? 1 : 0);
    for (i = 0; i < sizey; i++) {
        OLED_Set_Pos(x, i + y);
        for (m = 0; m < sizex; m++) {
            OLED_WR_Byte(BMP[j++], OLED_DATA);
        }
    }
}

// 配置OLED使用的P32 P33引脚为开漏输出模式
static void OLED_GPIO_Config() {             // OLED引脚配置
    P3_MODE_OUT_OD(GPIO_Pin_2 | GPIO_Pin_3); // I2C通讯引脚
}

/**
 * @brief 配置I2C协议
 */
static void I2C_Config() {
    I2C_InitTypeDef I2C_InitStructure;
    I2C_InitStructure.I2C_Mode = I2C_Mode_Master; // 主从模式选择,  I2C_Mode_Master,I2C_Mode_Slave
    I2C_InitStructure.I2C_Enable = ENABLE;        // I2C功能使能,   ENABLE, DISABLE
    I2C_InitStructure.I2C_MS_WDTA = DISABLE;      // 主机使能自动发送,  ENABLE, DISABLE
    I2C_InitStructure.I2C_Speed = 13;             // 总线速度=Fosc/2/(Speed*2+4), 0~63,Fosc是时钟频率
                                                  // 400K=24MHZ/2/(Speed*2+4)  解出Speed=13

    I2C_Init(&I2C_InitStructure);
    NVIC_I2C_Init(I2C_Mode_Master, DISABLE, Priority_0); // 主从模式, I2C_Mode_Master, I2C_Mode_Slave;
    // 中断使能, ENABLE/DISABLE; 优先级(低到高) Priority_0-3

    I2C_SW(I2C_P33_P32); // I2C_P14_P15,I2C_P24_P25,I2C_P33_P32
}

// 初始化
static void OLED_Config() {
    OLED_RES_Clr();
    delay_ms(200);
    OLED_RES_Set();

    OLED_WR_Byte(0xAE, OLED_CMD); //--关闭OLED面板
    OLED_WR_Byte(0x00, OLED_CMD); //---设置列地址低字节
    OLED_WR_Byte(0x10, OLED_CMD); //---设置列地址高字节
    OLED_WR_Byte(0x40, OLED_CMD); //--设置起始行地址 设置映射RAM显示起始行(0x00~0x3F)
    OLED_WR_Byte(0x81, OLED_CMD); //--设置对比度控制寄存器
    OLED_WR_Byte(0xCF, OLED_CMD); // 设置SEG输出电流亮度
    OLED_WR_Byte(0xA1, OLED_CMD); //--设置SEG/列映射 0xa0左右反置 0xa1正常
    OLED_WR_Byte(0xC8, OLED_CMD); // 设置COM/行扫描方向 0xc0上下反置 0xc8正常
    OLED_WR_Byte(0xA6, OLED_CMD); //--设置正常显示(非反色)
    OLED_WR_Byte(0xA8, OLED_CMD); //--设置复用比率(1到64)
    OLED_WR_Byte(0x3f, OLED_CMD); //--1/64占空比
    OLED_WR_Byte(0xD3, OLED_CMD); //-设置显示偏移 移位映射RAM计数器(0x00~0x3F)
    OLED_WR_Byte(0x00, OLED_CMD); //-无偏移
    OLED_WR_Byte(0xd5, OLED_CMD); //--设置显示时钟分频比/振荡器频率
    OLED_WR_Byte(0x80, OLED_CMD); //--设置分频比，设置时钟为100帧/秒
    OLED_WR_Byte(0xD9, OLED_CMD); //--设置预充电周期
    OLED_WR_Byte(0xF1, OLED_CMD); // 设置预充电为15时钟 & 放电为1时钟
    OLED_WR_Byte(0xDA, OLED_CMD); //--设置COM引脚硬件配置
    OLED_WR_Byte(0x12, OLED_CMD); // COM引脚配置值
    OLED_WR_Byte(0xDB, OLED_CMD); //--设置VCOMH
    OLED_WR_Byte(0x40, OLED_CMD); // 设置VCOM取消选择电平
    OLED_WR_Byte(0x20, OLED_CMD); //-设置页寻址模式(0x00/0x01/0x02)
    OLED_WR_Byte(0x02, OLED_CMD); // 页寻址模式值
    OLED_WR_Byte(0x8D, OLED_CMD); //--设置电荷泵使能/禁用
    OLED_WR_Byte(0x14, OLED_CMD); //--设置(0x10)禁用
    OLED_WR_Byte(0xA4, OLED_CMD); // 禁用全屏点亮(0xa4/0xa5)
    OLED_WR_Byte(0xA6, OLED_CMD); // 禁用反色显示(0xa6/a7)
    OLED_Clear();
    OLED_WR_Byte(0xAF, OLED_CMD); /*显示开启*/
}
void OLED_Init() {
    OLED_GPIO_Config();  // OLED引脚配置
    EAXSFR();            // 拓展寄存器使能打开
    I2C_Config();        // I2C配置
    OLED_Config();       // OLED初始化配置
    OLED_ColorTurn(0);   // 0正常显示，1 反色显示
    OLED_DisplayTurn(0); // 0正常显示 1 屏幕翻转显示
}
